app/controllers/orders_controller.rb

  def stage
    @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def stage2
    @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def create
     @order = Order.new(order_params)
     @order.stage_id = 1
    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("created_at", "custumer", "destination", "product", "stage_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-22 19:48:43.372947"], ["custumer", "Toby"], ["destination", "Abuja"], ["product", "Door fittings "], ["stage_id", 1], ["updated_at", "2014-11-22 19:48:43.372947"]]

  def update

    respond_to do |format|

      if @order.update(order_params)
---
UPDATE "orders" SET "account_approval" = ?, "account_comment" = ?, "current_location" = ?, "delivered" = ?, "updated_at" = ?, "warehouse_approval" = ? WHERE "orders"."id" = 2  [["account_approval", ""], ["account_comment", ""], ["current_location", ""], ["delivered", ""], ["updated_at", "2014-11-17 00:17:13.249858"], ["warehouse_approval", ""]]