app/controllers/sales_controller.rb

SELECT "orders".* FROM "orders"
---
  def complete
    @orders = Order.all